In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Handling Missing Values

In [3]:
string_data = pd.Series(['aardvark', 'artichock', np.nan, 'avocado'])
string_data

0     aardvark
1    artichock
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [11]:
# Forward fill
string_data.ffill()

0     aardvark
1    artichock
2    artichock
3      avocado
dtype: object

In [13]:
# Backward fill
string_data.bfill()

0     aardvark
1    artichock
2      avocado
3      avocado
dtype: object

In [14]:
string_data.dropna()

0     aardvark
1    artichock
3      avocado
dtype: object

In [15]:
from numpy import nan as NA

In [16]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [17]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.232103  0.019635  0.267810
1 -0.856861  0.770291  0.116512
2  1.216718  1.170547  1.076909
3 -0.538052  1.036629 -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

In [26]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

df

          0         1         2
0  0.232103       NaN       NaN
1 -0.856861       NaN       NaN
2  1.216718       NaN  1.076909
3 -0.538052       NaN -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

In [27]:
df.dropna()

          0         1         2
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

In [28]:
df.dropna(thresh = 2)

          0         1         2
2  1.216718       NaN  1.076909
3 -0.538052       NaN -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

# Filling In Missing Data

In [29]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [30]:
df

          0         1         2
0  0.232103       NaN       NaN
1 -0.856861       NaN       NaN
2  1.216718       NaN  1.076909
3 -0.538052       NaN -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

In [31]:
df.fillna(0)

          0         1         2
0  0.232103  0.000000  0.000000
1 -0.856861  0.000000  0.000000
2  1.216718  0.000000  1.076909
3 -0.538052  0.000000 -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

In [32]:
data.fillna(1)

     0    1    2    4
0  1.0  6.5  3.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  6.5  3.0  1.0

In [33]:
data.fillna(7)

     0    1    2    4
0  1.0  6.5  3.0  7.0
1  1.0  7.0  7.0  7.0
2  7.0  7.0  7.0  7.0
3  7.0  6.5  3.0  7.0

In [34]:
np.mean(data)

0    1.0
1    6.5
2    3.0
4    NaN
dtype: float64

In [37]:
data.fillna(np.mean(data))

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  6.5  3.0 NaN
2  1.0  6.5  3.0 NaN
3  1.0  6.5  3.0 NaN

In [35]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [36]:
print(df)
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.232103       NaN       NaN
1 -0.856861       NaN       NaN
2  1.216718       NaN  1.076909
3 -0.538052       NaN -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

          0         1         2
0  0.232103  0.500000  0.000000
1 -0.856861  0.500000  0.000000
2  1.216718  0.500000  1.076909
3 -0.538052  0.500000 -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

In [38]:
df

          0         1         2
0  0.232103       NaN       NaN
1 -0.856861       NaN       NaN
2  1.216718       NaN  1.076909
3 -0.538052       NaN -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

In [39]:
df.fillna(0, inplace = True)

In [40]:
df

          0         1         2
0  0.232103  0.000000  0.000000
1 -0.856861  0.000000  0.000000
2  1.216718  0.000000  1.076909
3 -0.538052  0.000000 -0.270283
4  0.178827  0.646211  0.266209
5  0.218063 -0.541750  0.034779
6 -1.199640  1.765948 -0.170857

In [41]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

df

          0         1         2
0 -0.408528  0.970634  0.897874
1  0.062746 -0.458290  0.998983
2  1.903408       NaN  0.257876
3 -2.525647       NaN -2.751490
4 -1.323219       NaN       NaN
5 -1.090989       NaN       NaN

In [42]:
df.fillna(method = "ffill")

          0         1         2
0 -0.408528  0.970634  0.897874
1  0.062746 -0.458290  0.998983
2  1.903408 -0.458290  0.257876
3 -2.525647 -0.458290 -2.751490
4 -1.323219 -0.458290 -2.751490
5 -1.090989 -0.458290 -2.751490

In [43]:
df.fillna(method = "bfill")

          0         1         2
0 -0.408528  0.970634  0.897874
1  0.062746 -0.458290  0.998983
2  1.903408       NaN  0.257876
3 -2.525647       NaN -2.751490
4 -1.323219       NaN       NaN
5 -1.090989       NaN       NaN

In [44]:
print(df)
df.fillna(method = "ffill", axis = 1)

          0         1         2
0 -0.408528  0.970634  0.897874
1  0.062746 -0.458290  0.998983
2  1.903408       NaN  0.257876
3 -2.525647       NaN -2.751490
4 -1.323219       NaN       NaN
5 -1.090989       NaN       NaN

          0         1         2
0 -0.408528  0.970634  0.897874
1  0.062746 -0.458290  0.998983
2  1.903408  1.903408  0.257876
3 -2.525647 -2.525647 -2.751490
4 -1.323219 -1.323219 -1.323219
5 -1.090989 -1.090989 -1.090989

In [45]:
df.fillna(method = "ffill", limit = 2)

          0         1         2
0 -0.408528  0.970634  0.897874
1  0.062746 -0.458290  0.998983
2  1.903408 -0.458290  0.257876
3 -2.525647 -0.458290 -2.751490
4 -1.323219       NaN -2.751490
5 -1.090989       NaN -2.751490

In [47]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [49]:
print(df)
df.iloc[:, 1]

          0         1         2
0 -0.408528  0.970634  0.897874
1  0.062746 -0.458290  0.998983
2  1.903408       NaN  0.257876
3 -2.525647       NaN -2.751490
4 -1.323219       NaN       NaN
5 -1.090989       NaN       NaN

0    0.970634
1   -0.458290
2         NaN
3         NaN
4         NaN
5         NaN
Name: 1, dtype: float64

# Data Transformation

# Removing Duplicates

In [50]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [52]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [54]:
data[data.duplicated()]

    k1  k2
6  two   4

In [55]:
data[~data.duplicated()]

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [56]:
# dropduplicate based on specific column or columns
data.drop_duplicates(subset = "k1")

    k1  k2
0  one   1
1  two   1

In [57]:
# dropduplicate based on specific column or columns
data.drop_duplicates(subset = "k1", keep = 'last')

    k1  k2
4  one   3
6  two   4

In [58]:
# dropduplicate based on specific column or columns
data.drop_duplicates(subset = "k2")

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [59]:
# dropduplicate based on specific column or columns
data.drop_duplicates(subset = "k2", keep = 'last')

    k1  k2
1  two   1
2  one   2
4  one   3
6  two   4

In [60]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

# Transforming Data Using a Function or Mapping

In [61]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                     'Pastrami', 'corned beef', 'Bacon',
                     'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [62]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [64]:
data['animal'] = data.food.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     NaN
4  corned beef     7.5     cow
5        Bacon     8.0     NaN
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [65]:
lowercased = data['food'].str.lower()

lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [66]:
data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [67]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# Replacing Values

In [68]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [69]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [70]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [71]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [72]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [78]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [82]:
transform = lambda x: x[:4].upper()

In [84]:
data.index.map(transform)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [86]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [87]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [88]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [89]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discretization and Binning

In [90]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [91]:
bins = [18, 25, 35, 60, 100]

In [92]:
cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [93]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [95]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [96]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [97]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [98]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [99]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [101]:
data = np.random.rand(20)
data

array([0.27081696, 0.53133454, 0.18046478, 0.6173507 , 0.99847508,
       0.50669737, 0.95336384, 0.210791  , 0.19979748, 0.69937695,
       0.32053108, 0.73906587, 0.84014965, 0.69668135, 0.81654916,
       0.3244397 , 0.69322651, 0.38974041, 0.58793429, 0.89836309])

In [102]:
pd.cut(data, 4, precision=2)

[(0.18, 0.38], (0.38, 0.59], (0.18, 0.38], (0.59, 0.79], (0.79, 1.0], ..., (0.18, 0.38], (0.59, 0.79], (0.38, 0.59], (0.38, 0.59], (0.79, 1.0]]
Length: 20
Categories (4, interval[float64]): [(0.18, 0.38] < (0.38, 0.59] < (0.59, 0.79] < (0.79, 1.0]]

In [104]:
data = np.random.randn(1000) # Normally distributed
data

array([ 1.31482027e+00, -6.50318774e-01,  3.49580160e-02,  4.70826252e-01,
        1.36583537e-01, -2.26592150e+00,  6.71848980e-01,  8.47569737e-01,
       -1.05738852e+00, -1.04778954e+00, -4.64043267e-01,  8.27663504e-01,
        3.10712420e-01, -1.04165494e-01, -3.56636945e-01,  1.01357741e+00,
        6.09193769e-01, -2.86696044e+00,  1.00136713e+00,  1.69777909e-01,
       -4.06609916e-01, -5.61524295e-01, -8.28550716e-01, -1.40839509e-01,
        1.48545201e+00,  1.51486991e-01,  3.77329248e-01,  3.47419413e-01,
        1.15784826e+00,  1.78555443e+00, -2.00645975e-02,  1.29681456e+00,
       -1.28277429e+00, -1.00929912e+00, -1.15189083e+00, -6.38829862e-01,
        2.11858419e+00,  9.18435021e-01, -4.52538986e-01, -1.72081507e-01,
       -2.24763374e+00,  6.93653867e-01,  8.27689600e-02, -1.68724422e+00,
        1.02967305e+00, -7.60434669e-01, -3.55225942e-01,  1.78404341e-01,
        6.52190260e-01, -1.33362102e+00, -1.24543670e+00,  3.43649787e-01,
        1.05006120e+00,  1.69081296e-01, -6.24501329e-01, -3.79057667e-01,
       -1.82911780e+00,  2.55030959e-02, -5.99277531e-01, -1.92475454e+00,
       -7.88327803e-01,  1.48257297e+00, -8.42089812e-02,  3.53186607e-01,
       -3.76620464e-01, -1.28325723e-01,  4.01769563e-01,  1.48432690e-01,
       -1.05122321e+00, -1.05120247e+00,  7.40719200e-01, -4.06054375e-01,
        1.31853511e+00,  5.25900519e-01,  9.19795424e-01, -1.27752838e+00,
       -3.78103159e-01, -6.12338160e-02,  1.62212795e-01, -5.46091950e-01,
       -3.43366652e-01, -4.17345366e-01,  1.86272397e+00, -2.06915745e-01,
       -3.81209622e-01, -1.53898939e+00, -1.65933237e+00, -3.01278218e-01,
       -1.53248448e-01, -7.86578280e-02,  1.02157521e-01, -1.28098038e+00,
       -5.16845790e-01, -2.09591573e-01, -6.06175005e-01, -1.40047551e-02,
        4.89918155e-01, -2.72838434e-01, -8.08466914e-01,  1.87118217e+00,
       -7.65818238e-01, -8.42131024e-01, -2.01385721e-01, -6.93715503e-01,
       -1.18962333e-02, -1.37227191e+00,  2.95149611e+00, -8.06301465e-01,
       -5.69532363e-01,  1.07376642e+00,  8.37892117e-01,  4.17683258e-01,
        6.91146568e-01, -3.70367180e-01,  9.06587697e-02,  7.78950199e-01,
       -1.24763953e+00, -1.80453060e-01,  3.55622343e-01, -3.62031094e-02,
       -1.22307637e-01,  4.65285332e-01,  2.17326618e+00,  1.69647879e-01,
       -1.18954522e+00, -1.35470451e+00,  8.51805163e-01, -1.38343963e+00,
       -2.14790138e+00,  4.32867547e-01,  9.64656771e-01, -6.06729609e-01,
       -9.51331726e-01, -6.03683072e-01,  7.09605109e-01,  4.72010011e-02,
       -6.36427143e-01, -1.31099064e+00,  1.22035307e+00, -7.52720793e-01,
       -1.96370275e+00,  8.18185608e-01, -1.66622642e+00,  4.33324692e-01,
        2.20635548e-01,  5.15522157e-01,  1.04970621e+00, -6.61685260e-02,
       -3.14793908e-01, -6.05475070e-02,  4.45925283e-01,  2.40884660e-01,
       -1.55090237e+00, -1.77846465e-01,  8.03297163e-01, -6.23772820e-01,
       -1.00047133e+00, -8.96891152e-01, -6.89405938e-01, -1.26005714e+00,
        1.17428707e+00,  1.78462932e-01,  1.54672339e+00,  2.83142936e-01,
        1.30229051e+00,  1.12565470e-01,  2.03755044e+00,  6.56806503e-01,
       -1.40005379e+00,  2.52857966e-01, -5.26156967e-01, -2.58757625e+00,
        1.09323659e+00, -1.14081908e+00,  1.19039203e-01,  1.06704693e+00,
       -4.04924907e-01, -6.03687596e-01, -2.47753358e-01,  1.39998807e+00,
       -1.87091833e+00,  1.04873205e-01,  3.30015653e-02, -1.44021533e-01,
        9.63204128e-01, -1.01690779e+00,  1.54704069e-01, -5.60996869e-01,
        2.86941747e-01,  1.45024817e+00, -2.19882000e+00, -7.25264644e-01,
       -1.56892949e+00,  7.90581452e-01, -8.58180887e-01,  4.92085597e-01,
        1.25116188e+00,  2.76201889e+00, -2.28149384e-01, -8.61208673e-01,
       -1.99354181e-02,  2.22799434e+00,  1.22060769e-01,  3.39901568e+00,
       -8.68048523e-03, -4.91069548e-02,  1.43909714e+00, -1.53444423e+00,
       -1.45198887e+00, -4.32375023e-01,  6.85296560e-01,  2.75444850e+00,
        2.30269426e+00,  4.82765146e-01, -1.13735411e+00,  1.07800758e-01,
        9.32121447e-01,  5.44421234e-01, -4.00537629e-01, -5.73916664e-01,
        4.96810967e-01,  2.53337513e+00, -4.28726870e-01,  3.52407872e-02,
       -1.13082385e-01,  1.61692583e+00, -4.99208652e-01,  6.93700182e-01,
        1.29314249e+00, -1.21154527e+00,  2.32829220e+00, -7.60160131e-01,
        6.70753407e-02, -9.19684936e-01,  4.88300575e-01,  1.19351169e+00,
       -8.61460589e-01, -2.14000033e+00,  2.07483900e-02, -2.54702085e-01,
       -3.52457265e-01,  5.06117272e-02, -2.68861847e-02, -9.69303218e-01,
        6.55588166e-01,  1.35219757e+00, -8.58184033e-01,  5.93437089e-01,
       -6.73054295e-01, -1.30325169e-01,  9.45366670e-01, -2.08191030e-01,
        1.20904181e+00,  2.66207311e-02, -3.41777105e-01, -4.20327751e-01,
        5.99633429e-01,  3.12977755e-01, -2.53275158e-01,  2.85379263e-01,
        8.58318563e-01, -3.37288739e+00,  1.47033251e+00,  2.54236849e-01,
       -2.19058847e+00, -5.41552201e-01, -2.88854527e-01, -2.19003003e+00,
       -1.61160183e+00,  1.20894743e+00,  2.29811535e-02,  1.32185905e+00,
       -1.30820982e+00,  3.26795265e-01, -4.30847717e-01, -1.70130454e+00,
       -3.99698149e-02, -1.33333098e+00, -5.17598415e-01, -4.41576376e-01,
        6.54350185e-01, -2.46689856e-01, -7.92469366e-01, -9.47899392e-01,
       -3.96712173e-01, -6.19577649e-01, -6.47112375e-01,  1.43247757e+00,
       -9.27458592e-01,  9.02470064e-01,  1.36777159e+00, -8.02220384e-01,
       -1.52122842e+00,  2.17522725e-01,  1.51981243e+00, -5.85010805e-01,
        1.10820017e-01,  5.40868901e-02, -6.99335272e-01, -5.39882433e-01,
        5.51725695e-04, -4.47235623e-01,  1.06094862e+00, -2.28179767e-01,
       -9.95135640e-01, -3.43516229e-01,  3.14039073e-01,  1.72016001e+00,
       -2.88990882e-01,  8.39597336e-01, -1.12025487e+00, -3.39425069e-01,
       -9.83164259e-01, -1.48838563e+00,  7.89756849e-01, -7.42238334e-01,
        1.53694528e+00,  3.35022593e-01,  8.72470927e-02,  1.46113654e-01,
        6.94828459e-01, -2.24258111e+00, -1.20201960e+00, -1.04723685e+00,
       -1.69086648e+00, -4.51152385e-01,  4.93585790e-01, -9.82099128e-01,
        3.14042447e-01,  5.21413623e-01, -2.28621967e+00, -5.07535549e-01,
       -7.43322210e-01, -3.90352990e-01, -7.67900565e-01, -4.22647759e-01,
       -9.58959048e-01,  1.01183032e-01,  3.67019007e-01,  4.91347186e-01,
        2.01976129e+00, -9.78778328e-01,  1.06367145e+00,  2.49037696e-01,
        1.21715451e+00, -5.07535809e-01,  1.57961050e+00, -2.21988686e-01,
        6.41348978e-01, -1.73331145e+00,  2.37310374e-01,  1.30631199e+00,
       -2.04656748e-01, -7.58803043e-01,  2.98531507e-01, -1.16927874e+00,
       -3.63672977e-01,  2.00482980e+00, -5.44780910e-01,  2.31700436e-01,
       -3.23122302e-02,  2.43860897e-01,  3.94813986e-01, -2.35059905e-01,
       -3.90214361e-01,  2.36330577e-01,  7.23451111e-01,  3.68063810e-01,
       -1.65066490e+00,  2.44107252e-02,  1.21730493e+00,  4.52051273e-02,
       -1.06480396e-01, -1.23132879e+00,  1.33764338e+00,  2.73219864e-01,
        2.33842599e-01,  6.88829957e-04,  2.73450010e+00,  1.29319684e+00,
       -8.93790728e-01, -4.70772836e-01, -4.48515562e-01, -4.85907458e-01,
       -7.88398591e-01,  3.22757651e-01, -1.90868729e-01, -1.27033077e+00,
        4.05694605e-02, -1.68275218e+00,  8.06625692e-01, -1.87574708e+00,
       -4.99593651e-01, -9.44252804e-02, -6.28746314e-01, -1.44510013e+00,
        1.07623141e+00,  5.07073348e-01,  1.43695818e-01,  1.36184869e+00,
       -1.71506691e+00, -2.63128289e+00, -8.38466921e-01, -2.17893533e-01,
        7.39684866e-01,  3.19158022e-01,  2.35748763e+00, -1.70495920e-02,
       -1.46006248e+00,  5.26408329e-01, -1.35043802e-01, -1.72478450e+00,
        2.02642813e+00,  1.00533278e+00,  6.99768984e-01,  9.64066398e-01,
        1.19079900e+00, -2.52398983e-02,  8.31296182e-02, -1.00282761e+00,
       -5.48077958e-01,  9.35013979e-01,  1.73373049e+00, -1.03913622e+00,
       -2.60449161e-01, -1.12761787e+00,  7.69094562e-01, -1.87846891e-01,
        1.37987453e+00,  8.18321531e-01, -6.95883237e-02,  4.11769755e-01,
       -9.73480786e-03, -8.61307764e-01, -8.88682898e-01, -1.30890344e+00,
       -9.24460985e-02, -2.58852914e-01, -6.02000380e-01,  5.61240379e-01,
        1.22288541e+00,  1.75568327e+00, -2.54759813e-01, -6.60613057e-01,
       -5.31856170e-01, -1.73617121e-01,  8.78505728e-02,  1.14152579e+00,
        4.73274530e-02,  2.56466419e+00,  5.63447386e-01, -6.96712281e-01,
        3.11651812e-01,  1.80574018e-01,  9.29891542e-02,  4.18422502e-01,
       -2.54772646e+00,  1.82975355e+00, -1.09114350e-01, -8.71008970e-01,
       -1.97353003e+00,  4.80718413e-01,  1.21739139e+00,  8.79193975e-01,
       -3.51273316e-01,  1.28976771e-01, -1.04537525e+00, -7.31141438e-01,
       -9.40365758e-01,  4.66542316e-02,  9.85011185e-01,  6.91054965e-01,
        2.60933098e+00, -4.37188513e-01,  1.20181727e+00,  9.19798046e-01,
       -1.36471672e+00,  6.04565222e-01,  4.20543589e-01, -1.40072271e+00,
       -1.19890953e+00, -5.96447946e-01, -1.33026991e+00, -2.68530038e+00,
       -1.29437101e+00, -6.45913229e-02,  1.19865155e+00,  6.04231970e-01,
       -1.77497208e+00,  1.37526665e-01, -1.46320840e+00, -1.13716131e-01,
        4.20015385e-01, -1.22603112e+00, -7.97189760e-02, -2.37460655e+00,
        1.50650558e+00,  1.07650756e+00,  1.02639389e+00, -1.32524527e+00,
       -5.79315938e-01,  4.80924042e-01, -4.90946647e-01,  1.94426173e-01,
       -1.07476099e+00,  1.96871165e+00,  2.51719208e+00,  7.59136076e-02,
       -6.58936681e-01, -1.42409321e+00,  6.07249573e-01,  2.03321713e+00,
        1.00669570e+00, -5.68938520e-01,  6.74508030e-01,  1.67034539e+00,
        8.93747594e-01, -1.98177835e-01, -5.37217552e-02, -3.38315883e-01,
       -2.21993971e-01,  6.48719025e-01, -7.42205350e-02, -1.10382680e+00,
        1.12400279e+00, -9.42318942e-02, -1.77798054e-02,  1.98299942e-01,
        1.03274543e+00,  1.52845770e+00, -2.93154017e-01, -1.53375591e+00,
        1.07991952e+00, -7.16369937e-01,  7.95941918e-01,  1.88248276e+00,
       -1.44358969e+00, -4.71659388e-01,  3.79117395e-01, -1.16969184e-02,
        8.28007405e-01,  1.67364558e+00, -3.01884203e-01, -2.19076540e-01,
        5.71177868e-02,  3.28769658e-01,  1.53827161e-01, -1.02756809e+00,
       -1.45255772e-01,  4.97435364e-01, -2.57666627e-01, -3.63742679e-01,
       -4.32688747e-01,  5.25257464e-01, -3.79356819e-01,  3.96299390e-01,
       -2.51767212e-02, -2.13547717e+00,  5.41979345e-01, -1.02006825e+00,
       -5.28286810e-01,  1.00054091e-01, -1.43234598e+00, -6.74675554e-01,
        3.73991504e-01,  4.58140543e-01,  1.40739977e-01, -4.36623403e-01,
       -1.77141846e+00, -3.74568921e-01, -2.32267901e+00, -1.80547993e+00,
       -3.78390664e-01, -1.47257638e+00,  1.46980325e+00, -1.12024786e+00,
       -1.65086590e-01,  2.19530552e-01,  3.02464815e-01, -1.05862010e+00,
       -5.71161573e-01, -2.31129498e-01,  2.03971614e+00, -1.26533660e+00,
       -7.65980891e-01,  3.93039728e-01, -1.35640845e+00,  3.83139467e-01,
        1.26775934e+00, -2.06014721e-01,  2.22671342e-01, -1.70992306e+00,
        1.07545678e+00, -1.71088989e-01, -7.12097591e-01, -1.20494883e-01,
       -6.25917975e-01,  1.07894323e+00, -5.78473230e-01, -1.11741686e+00,
        1.39073497e-01, -1.16579314e+00, -5.11596253e-01, -1.14883843e-01,
        5.63680572e-02,  1.13394494e+00,  1.12083189e+00, -4.66813136e-01,
        2.89657907e-01,  6.20601667e-01,  7.46091045e-01, -4.99525440e-01,
        8.27352271e-01,  5.90280518e-01,  1.09593667e+00,  1.20938842e+00,
        4.17635925e-01, -4.79323074e-01, -6.78422260e-01, -8.54898287e-02,
       -2.23182675e-01, -1.96457902e+00, -1.33403067e-02,  1.03319822e+00,
        1.36706614e+00, -1.13244052e+00, -2.51699736e-01,  2.08552057e+00,
       -2.37085820e+00,  2.36835098e+00,  1.20862938e+00, -9.24858057e-01,
       -8.12798718e-01, -2.73914317e-02, -2.48806519e-01,  1.08116930e-01,
       -1.76569350e-01, -2.94426709e-01, -1.38796388e+00, -7.39706855e-01,
        1.11897702e+00,  1.14926824e+00, -2.57959533e-01,  3.46858178e-01,
        7.64641714e-01,  1.85976160e+00,  7.02746685e-01, -2.13135889e+00,
        1.20788093e+00, -4.62879945e-01,  1.04035878e+00,  6.42798526e-01,
        1.18427011e+00,  6.89804737e-01, -1.28352706e-01,  9.64229060e-02,
        1.46579315e+00,  1.31337789e+00,  1.11860414e+00, -9.16064600e-01,
        4.28978105e-01,  1.63932189e-02, -7.03517924e-01, -1.58534540e+00,
        8.63620202e-01,  5.13903323e-01,  2.51400882e-01, -1.09615237e+00,
       -6.56865835e-01, -1.59720326e-01, -1.46131136e-01, -6.95133682e-01,
        3.49233233e-01, -5.83033185e-01,  1.51512502e-01, -2.35938589e-01,
       -2.68304322e-01,  9.30842705e-01, -5.89175129e-01, -3.74952932e-01,
       -6.75107488e-01,  2.69244825e-01, -4.49557733e-01,  8.50361022e-01,
       -1.20073178e+00, -3.10211006e+00,  2.12677754e-01,  3.92495982e-01,
       -2.76057978e-01, -5.25636878e-01,  1.92298045e-01, -9.83532649e-01,
        8.34486264e-01, -1.51351005e+00, -1.10373158e+00, -1.43087469e-01,
        7.61733015e-01, -6.32476302e-01,  2.52365919e-01, -6.38081623e-01,
       -4.14964846e-01,  2.76035540e+00,  5.86937851e-01,  7.27303566e-01,
       -9.38039086e-01,  4.53859663e-03,  1.59124244e+00, -1.66311670e-01,
       -1.93632710e+00,  1.46945254e+00,  2.16835641e+00,  2.14938176e-01,
       -4.95950390e-01, -8.09984051e-01, -4.35500411e-01, -1.05488667e+00,
       -2.52382529e-01,  3.76188809e-01, -4.41160256e-01, -1.96518270e+00,
        1.17003149e-02, -1.23548998e+00, -1.31256803e+00,  6.21378878e-02,
       -9.66844125e-01, -2.21359081e+00, -1.32507690e+00,  6.43318600e-01,
       -3.43749567e-01, -2.38890326e+00, -4.06963312e-01,  1.88805687e+00,
        1.16693208e-01,  5.56149224e-02,  5.65120814e-01,  1.13108194e+00,
       -1.24291925e+00,  7.07545894e-01,  3.01029559e-02,  9.55346220e-01,
        1.16991579e+00,  4.73851642e-01,  1.11521943e+00,  5.10599638e-01,
        1.19314389e+00,  3.36769924e-01, -1.15166680e+00, -1.53230395e+00,
       -7.18988712e-01, -2.35375906e-01, -9.61625792e-01, -8.15752186e-01,
       -4.16294810e-01, -2.64025633e-02, -5.05032570e-01, -1.35122470e+00,
        8.85152716e-02,  3.71980425e-01,  1.60571897e-01, -1.13708056e+00,
        9.26578594e-01, -7.92663736e-01, -4.62628719e-01,  7.62095798e-01,
        5.58573741e-01,  5.59720924e-01,  2.69603000e-02, -3.14720739e-01,
       -1.77789614e+00, -6.47217989e-02,  8.28898880e-01,  6.61848269e-02,
       -1.61360120e+00,  7.67643060e-01,  3.21853836e-01, -1.34542135e-01,
        3.79802268e-01, -1.99665365e+00,  1.85473205e+00, -8.35341409e-01,
        1.47582254e-01, -2.46006049e-01, -6.61574248e-01, -1.83820109e-01,
        1.44136033e+00,  2.52469896e-01,  4.78968865e-01,  8.63444126e-01,
        1.13825365e-01,  1.78707564e-01, -5.72637584e-01, -2.52736262e-02,
       -2.24738065e+00,  5.49590840e-01,  1.16033441e-02, -1.20353632e+00,
       -7.14049530e-01, -5.10935189e-01,  2.69519440e-01, -1.90147094e+00,
        3.77385907e-01,  2.01113451e+00,  4.09254638e-01,  2.24799846e-01,
       -1.83269704e+00,  1.60989498e-01,  5.96016412e-01,  2.06706492e-01,
        1.46793393e+00, -9.71320863e-02,  1.26989271e+00,  1.33705645e+00,
        4.11140275e-01, -9.12692263e-01, -4.59869867e-01,  4.06436072e-01,
        1.85502263e-01, -1.20936422e+00, -5.47871985e-01,  1.16958818e+00,
       -8.53113685e-01,  6.08765896e-01, -5.89366313e-01,  1.13721182e-01,
       -8.02601434e-01, -3.24235078e-01,  9.89774553e-01,  2.34256888e-01,
       -8.26590950e-01, -1.50160210e-01, -9.64172343e-01,  1.83669041e-01,
        4.54513119e-01,  1.09931814e+00, -4.30816658e-01,  1.46998136e+00,
        1.38033716e-01, -2.52959283e-01,  1.09864557e-01, -1.20708277e+00,
        1.25866430e+00,  1.01412643e+00,  1.74573517e+00, -8.53716679e-01,
        1.38795203e+00,  1.73523669e+00,  1.35147373e-01,  6.59543734e-02,
        3.78781618e-01,  1.86730967e+00, -4.21764781e-01,  8.47006285e-01,
        3.48390406e-01,  1.49401315e+00,  1.19027696e+00,  8.07589916e-01,
       -1.10668169e+00,  9.81761873e-01,  1.26348542e+00, -8.83466960e-01,
        8.55376323e-01,  5.84567098e-01,  3.18777344e-01,  7.39689510e-02,
        3.60308081e-01,  1.75470073e+00, -7.84578894e-01,  6.57798358e-02,
       -2.69227590e-01, -6.24152691e-01, -1.24768620e+00, -4.87300412e-02,
        1.25349498e+00,  5.87616330e-01,  1.82805254e+00,  2.70232568e+00,
        8.21974339e-01,  2.41151875e-01, -1.05289598e+00, -6.43059326e-01,
       -6.03204834e-01,  8.87544365e-01, -6.84231159e-01,  1.21674880e+00,
       -7.44526562e-01, -6.60166795e-01, -5.83613834e-01,  9.10901429e-01,
       -8.65546994e-01,  9.94209112e-01,  1.84351702e+00,  3.97016219e-01,
       -5.64507895e-01,  1.97935688e-01, -1.04266318e+00, -8.46529378e-01,
        5.22135880e-01, -5.17446990e-01,  4.82407307e-01, -7.60674971e-01,
        4.92750237e-01,  2.79721196e-01,  5.48963357e-01,  8.50767670e-01,
        8.75644302e-01, -5.79014714e-01,  2.37348141e+00, -9.56631894e-01,
       -1.24083569e+00,  1.49793195e+00,  3.87390554e-01,  2.86749469e-02,
       -1.43921596e+00,  1.11831236e+00,  6.58778191e-01,  8.89550333e-01,
       -1.12529776e+00,  6.39446086e-01, -2.40835467e-01,  1.57079504e+00,
       -9.22532764e-02, -2.50363148e-01,  6.39002967e-02,  3.60237022e-01,
        1.39309565e+00, -1.45132664e+00,  1.13951168e+00, -9.07510056e-01,
        1.00028529e-02,  2.59929124e-01, -6.64792863e-01,  8.49008889e-02,
       -2.33463335e+00,  6.35602259e-01,  1.62913094e-01, -1.64639596e+00,
        4.21721453e-01, -8.39899254e-01,  9.21862367e-01, -2.32821879e-01,
        1.44902627e+00, -5.65054358e-01,  8.61449644e-01,  1.51508841e+00,
       -9.31769884e-01,  1.02225766e+00, -4.35242370e-01, -1.55769875e-01,
       -4.62337526e-01, -1.48853345e+00, -2.18502802e-01, -4.44348480e-01,
        2.01505279e+00, -1.39661306e+00,  6.98104375e-01, -4.17206001e-01,
       -7.42762090e-01, -7.92460655e-02,  1.23976849e+00,  2.04809012e-01,
        1.65711736e+00, -4.12085552e-02,  1.11809511e+00, -2.20248152e+00,
        2.20129879e-01,  2.94303808e-01, -8.60578978e-01,  5.00368974e-01,
        2.80895229e-03, -6.26632948e-01, -1.22576705e+00, -4.05447130e-01,
       -7.43698470e-01, -1.32181987e+00, -4.09597783e-02, -9.03345143e-01,
       -1.59799329e+00, -1.33281486e+00,  1.29280592e-01,  1.30488172e+00,
       -3.43679060e-01, -1.88871645e+00,  9.68680736e-01, -2.34659724e+00,
       -1.13138859e+00,  4.19771635e-01,  9.34483182e-01, -2.95867032e-01,
       -2.48892539e+00, -7.96733987e-02, -6.32617901e-01,  1.15973889e+00,
       -1.46019442e-01, -4.86562778e-01,  4.20239577e-01, -1.33833781e-02,
       -5.49357341e-01,  7.20410593e-01,  1.35896539e+00,  8.31720184e-01])

In [105]:
cats = pd.qcut(data, 4) # Cut into quartiles

cats

[(0.642, 3.399], (-0.662, -0.0252], (-0.0252, 0.642], (-0.0252, 0.642], (-0.0252, 0.642], ..., (-0.0252, 0.642], (-0.662, -0.0252], (0.642, 3.399], (0.642, 3.399], (0.642, 3.399]]
Length: 1000
Categories (4, interval[float64]): [(-3.374, -0.662] < (-0.662, -0.0252] < (-0.0252, 0.642] < (0.642, 3.399]]

In [106]:
pd.value_counts(cats)

(0.642, 3.399]       250
(-0.0252, 0.642]     250
(-0.662, -0.0252]    250
(-3.374, -0.662]     250
dtype: int64

In [107]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.254, 3.399], (-1.309, -0.0252], (-0.0252, 1.254], (-0.0252, 1.254], (-0.0252, 1.254], ..., (-0.0252, 1.254], (-1.309, -0.0252], (-0.0252, 1.254], (1.254, 3.399], (-0.0252, 1.254]]
Length: 1000
Categories (4, interval[float64]): [(-3.374, -1.309] < (-1.309, -0.0252] < (-0.0252, 1.254] < (1.254, 3.399]]

In [126]:
#pd.qcut(data, [0, 0.1, .5, .75, 1]).value_counts()

# Detecting and Filtering Outliers

In [108]:
data = pd.DataFrame(np.random.randn(1000, 4))

data

            0         1         2         3
0    0.566559  0.534897 -0.155819  0.964928
1    0.870055 -0.973266  0.645954 -1.259124
2    0.614331  1.278345 -1.151889  2.678617
3    1.477248  2.132959  0.301303 -1.134538
4   -2.047969  0.023393  0.996029  1.856201
..        ...       ...       ...       ...
995 -0.493630  1.513193  1.327980 -0.240104
996  1.071681  0.313604 -0.689844 -0.326424
997 -0.349773  0.263213  0.457165  0.125471
998 -0.275843  1.543439  0.419522  0.735591
999  1.442194  0.548704 -1.800358 -1.133901

[1000 rows x 4 columns]

In [109]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000346    -0.025835     0.024996     0.015410
std       0.983106     0.998489     1.020113     1.016653
min      -2.903001    -2.966199    -3.248157    -2.632604
25%      -0.684547    -0.708893    -0.655505    -0.673582
50%      -0.026576    -0.027183     0.014900    -0.021315
75%       0.689995     0.673514     0.669147     0.713780
max       3.088498     2.979134     3.083746     3.045594

In [111]:
col = data[2]
col

0     -0.155819
1      0.645954
2     -1.151889
3      0.301303
4      0.996029
         ...
995    1.327980
996   -0.689844
997    0.457165
998    0.419522
999   -1.800358
Name: 2, Length: 1000, dtype: float64

In [112]:
col[np.abs(col) > 3]

131   -3.248157
450    3.030949
665    3.064259
991    3.083746
Name: 2, dtype: float64

In [113]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
48  -0.747180  1.032582  1.101519  3.045594
131 -0.131135 -0.209751 -3.248157 -0.679119
450 -1.392792  1.030455  3.030949 -0.853681
665  0.365338 -0.141474  3.064259 -0.418920
874  3.088498 -0.793558 -0.929250  1.309089
991 -0.572753  1.382217  3.083746  0.963626

In [129]:
np.array([True, True, False]).any()

True

In [130]:
np.array([True, True, False]).all()

False

In [115]:
data[np.abs(data) > 3] = np.sign(data) * 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000257    -0.025835     0.025065     0.015364
std       0.982831     0.998489     1.018817     1.016518
min      -2.903001    -2.966199    -3.000000    -2.632604
25%      -0.684547    -0.708893    -0.655505    -0.673582
50%      -0.026576    -0.027183     0.014900    -0.021315
75%       0.689995     0.673514     0.669147     0.713780
max       3.000000     2.979134     3.000000     3.000000

In [116]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0 -1.0
2  1.0  1.0 -1.0  1.0
3  1.0  1.0  1.0 -1.0
4 -1.0  1.0  1.0  1.0

# Permutation and Random Sampling

In [117]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [118]:
sampler = np.random.permutation(5)

sampler

array([4, 3, 1, 2, 0])

In [119]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [120]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3

In [121]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3

In [123]:
choices = pd.Series([5, 7, -1, 6, 4])

choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [124]:
draws = choices.sample(n=10, replace=True)

draws

4    4
0    5
1    7
4    4
1    7
2   -1
4    4
4    4
1    7
2   -1
dtype: int64

# Computing Indicator/Dummy Variables

In [131]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [132]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [133]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [134]:
df_with_dummy = df[['data1']].join(dummies)

df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [136]:
mnames = ['movie_id', 'title', 'genres']

mnames

['movie_id', 'title', 'genres']

In [139]:
movies = pd.read_table('datasets/one_hote_encode.xlsx', sep='::',
                        header=None, names=mnames)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [142]:
a = pd.Series(['A','B','C','A','B','C'])
pd.get_dummies(a)

   A  B  C
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0
4  0  1  0
5  0  0  1